Repository: BlankOn/grub2
Catalog: debian/po/*.po
Languages: el

source: Chainload from menu.lst?
el: Να γίνει αλυσιδωτή φόρτωση από το αρχείο menu.lst;

source: GRUB upgrade scripts have detected a GRUB Legacy setup in /boot/grub.
el: Τα σενάρια αναβάθμισης του GRUB έχουν εντοπίσει αρχεία ρύθμισης του GRUB Legacy στον κατάλογο /boot/grub.

source: In order to replace the Legacy version of GRUB in your system, it is recommended that /boot/grub/menu.lst is adjusted to chainload GRUB 2 from your existing GRUB Legacy setup. This step may be automaticaly performed now.
el: Για να αντικαταστήσετε την έκδοση Legacy του GRUB στο σύστημά σας, συνιστάται η προσαρμογή του αρχείου /boot/grub/menu.lst ώστε να φορτώνεται αλυσιδωτά το GRUB 2 μέσα από την υπάρχουσα ρύθμιση του GRUB Legacy. Το βήμα αυτό μπορεί να πραγματοποιηθεί τώρα αυτόματα.

source: It's recommended that you accept chainloading GRUB 2 from menu.lst, and verify that your new GRUB 2 setup is functional for you, before you install it directly to your MBR (Master Boot Record).
el: Συνιστάται η αποδοχή της αλυσιδωτής φόρτωσης του GRUB 2 από το αρχείο menu.lst και η επαλήθευση της λειτουργικότητας της νέας ρύθμισης του GRUB 2 πριν να το εγκαταστήσετε απευθείας στο MBR (Master Boot Record).

source: In either case, whenever you want GRUB 2 to be loaded directly from MBR, you can do so by issuing (as root) the following command:
el: Σε οποιαδήποτε περίπτωση όποτε θελήσετε να φορτωθεί το GRUB 2 απευθείας από το MBR μπορείτε να το κάνετε τρέχοντας (ως χρήστης root) την ακόλουθη εντολή:

source: GRUB installation failed. Continue?
el: Η εγκατάσταση του GRUB απέτυχε. Να συνεχίσω;

source: GRUB failed to install to the following devices:
el: Απέτυχε η εγκατάσταση του GRUB στις ακόλουθες συσκευές:

source: Do you want to continue anyway? If you do, your computer may not start up properly.
el: Θέλετε να συνεχίσετε έτσι κι αλλιώς; Αν ναι, είναι πιθανόν ο υπολογιστής σας να μην μπορεί να εκκινηθεί κανονικά.

source: GRUB installation failed. Try again?
el: Η εγκατάσταση του GRUB απέτυχε. Θα ξαναπροσπαθήσετε;

source: You may be able to install GRUB to some other device, although you should check that your system will boot from that device. Otherwise, the upgrade from GRUB Legacy will be cancelled.
el: Είναι πιθανόν να εγκαταστήσετε το GRUB σε κάποια άλλη συσκευή, αλλά θα πρέπει να ελέγξετε ότι το σύστημά σας μπορεί να εκκινηθεί από αυτή τη συσκευή. Διαφορετικά, η αναβάάθμιση από την έκδοση Legacy του GRUB θα ακυρωθεί.

source: Continue without installing GRUB?
el: Συνέχεια χωρίς εγκατάσταση του GRUB;

source: You chose not to install GRUB to any devices. If you continue, the boot loader may not be properly configured, and when your computer next starts up it will use whatever was previously in the boot sector. If there is an earlier version of GRUB 2 in the boot sector, it may be unable to load modules or handle the current configuration file.
el: Επιλέξατε να μην εγκαταστήσετε το GRUB σε οποιαδήποτε συσκευή. Αν συνεχίσετε, ο φορτωτής εκκίνησης πιθανόν να μην έχει ρυθμιστεί σωστά και στην επανεκκίνηση του υπολογιστή σας θα χρησιμοποιήσει οτιδήποτε υπήρχε πριν στον τομέα εκκίνησης. Αν υπάρχει μια προηγούμενη έκδοση του GRUB 2 στον τομέα εκκίνησης, πιθανόν να μην μπορεί να φορτώσει κάποια αρθρώματα ή να χειριστεί το τρέχον αρχείο ρυθμίσεων.

source: If you are already running a different boot loader and want to carry on doing so, or if this is a special environment where you do not need a boot loader, then you should continue anyway. Otherwise, you should install GRUB somewhere.
el: Αν έχετε ήδη έναν διαφορετικό φορτωτή εκκίνησης και θέλετε να συνεχίσετε με αυτόν ή αν αυτό το σύστημα είναι ένα ειδικό περιβάλλον στο οποίο δεν χρειάζεστε έναν φορτωτή εκκίνησης, τότε θα πρέπει να συνεχίσετε έτσι κι αλλιώς. Διαφορετικά, θα πρέπει να εγκαταστήσετε κάπου το GRUB.

source: Finish conversion to GRUB 2 now?
el: Να τελειώσει τώρα η μετατροπή σε GRUB 2;

source: This system still has files from the GRUB Legacy boot loader installed, but it now also has GRUB 2 boot records installed on these disks:
el: Το σύστημα έχει ακόμα εγκατεστημένα αρχεία από τον φορτωτή εκκίνησης GRUB Legacy, αλλά έχει τώρα επίσης εγκατεστημένα αρχεία εκκίνησης του GRUB 2 στους εξής δίσκους:

source: It seems likely that GRUB Legacy is no longer in use, and that you should instead upgrade the GRUB 2 images on these disks and finish the conversion to GRUB 2 by removing old GRUB Legacy files. If you do not upgrade these GRUB 2 images, then they may be incompatible with the new packages and cause your system to stop booting properly.
el: Φαίνεται πιθανόν ότι ο φορτωτής εκκίνησης GRUB Legacy δεν είναι πια σε χρήση και ότι θα πρέπει να κάνετε την αναβάθμιση σε GRUB 2 στους παρακάτω δίσκους και να ολοκληρώσετε την μετατροπή στο GRUB 2 αφαιρώντας οποιαδήποτε παλιότερα αρχεία του GRUB Legacy. Αν δεν αναβαθμίσετε αυτές τις εικόνες του GRUB 2, τότε πιθανόν να είναι ασύμβατες με τα νεώτερα πακέτα, με αποτέλεσμα να σταματήσει η κανονική εκκίνηση του συστήματός σας.

source: You should generally finish the conversion to GRUB 2 unless these boot records were created by a GRUB 2 installation on some other operating system.
el: Θα πρέπει γενικά να τελειώσετε την μετατροπή σε GRUB 2 εκτός κι αν αυτά τα αρχεία εκκίνησης έχουν δημιουργηθεί από μια εγκατάσταση του GRUB 2 σε ένα άλλο λειτουργικό σύστημα.

source: Linux command line:
el: Γραμμή εντολής Linux:

source: The following Linux command line was extracted from /etc/default/grub or the `kopt' parameter in GRUB Legacy's menu.lst. Please verify that it is correct, and modify it if necessary.
el: Η επόμενη γραμμή εντολών για Linux έχει εξαχθεί από το αρχείο /etc/default/grub ή από την παράμετρο `kopt' στο αρχείο menu.lst του GRUB Legacy. Παρακαλώ επιβεβαιώστε ότι είναι ορθή και τροποποιήστε την αν είναι απαραίτητο.

source: Linux default command line:
el: Προκαθορισμένη γραμμή εντολών Linux:

source: The following string will be used as Linux parameters for the default menu entry but not for the recovery mode.
el: Η ακόλουθη συμβολοσειρά θα χρησιμοποιηθεί για τις παραμέτρους Linux στην προκαθορισμένη είσοδο του μενού εκκίνησης αλλά όχι για την κατάσταση διάσωσης (rescue mode).

source: kFreeBSD command line:
el: Γραμμή εντολών kFreeBSD:

source: The following kFreeBSD command line was extracted from /etc/default/grub or the `kopt' parameter in GRUB Legacy's menu.lst. Please verify that it is correct, and modify it if necessary.
el: Η επόμενη γραμμή εντολών του kFreeBSD έχει εξαχθεί από το αρχείο /etc/default/grub ή από την παράμετρο `kopt' στο αρχείο menu.lst του GRUB Legacy. Παρακαλώ επιβεβαιώστε ότι είναι ορθή και τροποποιήστε την αν είναι απαραίτητο.

source: kFreeBSD default command line:
el: Προκαθορισμένη γραμμή εντολών kFreeBSD:

source: The following string will be used as kFreeBSD parameters for the default menu entry but not for the recovery mode.
el: Η ακόλουθη συμβολοσειρά θα χρησιμοποιηθεί για τις παραμέτρους kFreeBSD στην προκαθορισμένη είσοδο του μενού εκκίνησης αλλά όχι για την κατάσταση διάσωσης (rescue mode).

source: /boot/grub/device.map has been regenerated
el: Το αρχείο /boot/grub/device.map έχει αναδημιουργηθεί

source: The file /boot/grub/device.map has been rewritten to use stable device names. In most cases, this should significantly reduce the need to change it in future, and boot menu entries generated by GRUB should not be affected.
el: Το αρχείο /boot/grub/device.map έχει ξαναγραφεί ώστε να χρησιμοποιεί έγκυρα και σταθερά ονόματα συσκευών. Στις περισσότερες περιπτώσεις αυτό θα μειώσει αισθητά την ανάγκη αλλαγής του στο μέλλον, ενώ τα στοιχεία του μενού εκκίνησης που παράγονται από το GRUB δεν θα επηρεάζονται.

source: However, since you have more than one disk in your system, it is possible that you were depending on the old device map. Please check whether you have any custom boot menu entries that rely on GRUB's (hdN) drive numbering, and update them if necessary.
el: Παρόλα αυτά και αφού έχετε περισσότερους από έναν δίσκους στο σύστημά σας, είναι πιθανόν η δημιουργία του να εξαρτάται από το παλιότερο αρχείο συσκεών device.map. Παρακαλώ ελέγξτε αν υπάρχουν οποιεσδήποτε ειδικές είσοδοι στο μενού εκκίνησης που να στηρίζονται στην αρίθμηση των συσκευών από το GRUB (hdN) και ενημερώστε τις αν είναι απαραίτητο.

source: If you do not understand this message, or if you do not have any custom boot menu entries, you can ignore this message.
el: Αν δεν καταλαβαίνετε το παρόν μήνυμα, ή αν δεν έχετε οποιεσδήποτε ειδικές εισόδους στο μενού εκκίνησης, μπορείτε να το αγνοήσετε.
